<a href="https://colab.research.google.com/github/jayjinnie/TAVE7th_MachineLearningStudy/blob/main/1%EC%9E%A5_%ED%8C%8C%EC%9D%B4%EC%8D%AC_%EA%B8%B0%EB%B0%98%EC%9D%98_%EB%A8%B8%EC%8B%A0%EB%9F%AC%EB%8B%9D%EA%B3%BC_%EC%83%9D%ED%83%9C%EA%B3%84_%EC%9D%B4%ED%95%B4%3B_%EB%8D%B0%EC%9D%B4%ED%84%B0_%ED%95%B8%EB%93%A4%EB%A7%81_%ED%8C%90%EB%8B%A4%EC%8A%A4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API

In [ ]:
import pandas as pd

titanic_df = pd.read_csv('train.csv')
print('titanic 변수 type:', type(titanic_df))
titanic_df

In [ ]:
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [ ]:
print('DataFrame 크기:', titanic_df.shape) # row: 891개, col: 12개

DataFrame 크기: (891, 12)

In [ ]:
titanic_df.info()
# info(): 전체 row 수, 칼럼별 데이터 타입, Null 데이터 개수를 반환

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic_df.describe()
# describe(): 칼럼별 '숫자형' 데이터 값의 n-percentile 분포도, 평균값, 표준편차, 최댓값, 최솟값 반환
# object 타입의 칼럼은 출력에서 제외

       PassengerId    Survived      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
# 지정 칼럼의 데이터값 건수를 반환, 데이터 분포도를 확인하는 데 유용
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
# Pclass 3은 총 491개, 1은 216개, 2는 184개

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
# 'Pclass'라는 특정 칼럼 데이터 세트를 Series 형태로 반환
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

titanic_pclass.head()
# 데이터 값에 각각의 index가 할당되어 있음
# 왼편의 수는 Series의 index / 오른편의 수는 Series의 데이터 값

<class 'pandas.core.series.Series'>

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [ ]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
# value_counts()는 DataFrame에는 없고, Series 객체에만 정의되어 있음
# 때문에 value_counts의 type은 Series에 해당!

print(value_counts)
# value_counts()는 칼럼 값별 데이터 건수를 반환하므로, Series에 3, 1, 2로 index가 부여되어 있음
# 따라서, value_counts()를 이용해 고유 칼럼 값을 식별자로 사용할 수 있음

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

# DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환
### 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

In [ ]:
import numpy as np

col_name1 = ['col1']
list1 = [1,2,3]

array1 = np.array(list1)
print('array1 shape:', array1.shape)

array1 shape: (3,)

##### 1차원의 리스트와 ndarray를 기반으로 DataFrame 생성

In [ ]:
# 리스트를 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)

1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [ ]:
# 넘파이 ndarray를 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

###### 2행 3열 형태의 리스트와 ndarray를 기반으로 DataFrame 생성

In [ ]:
# col이 3개이므로 3개의 칼럼명이 필요!
col_name2 = ['col1', 'col2', 'col3']

# 2행 x 3열 형태의 리스트와 ndarray를 생성한 후, 이를 DataFrame으로 변환
list2 = [[1, 2, 3],
         [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape)

array2 shape: (2, 3)

In [ ]:
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)

2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [ ]:
df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array2)

2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

##### 딕셔너리를 DataFrame으로 변환

In [ ]:
# 딕셔너리의 키(Key)는 '칼럼명', 값(Value)는 '키에 해당하는 칼럼 데이터'로 변환됨
# Key는 '문자열' 칼럼명으로 매핑, Value는 '리스트 or ndarray' 칼럼 데이터로 매핑

dict = {'col1':[1,11], 'col2':[2,22], 'col3':[3,33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

### DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

In [ ]:
print('df_dict의 타입:', type(df_dict))
print('변환되기 전의 DataFrame:\n', df_dict)
array3 = df_dict.values

df_dict의 타입: <class 'pandas.core.frame.DataFrame'>
변환되기 전의 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

###### DataFrame을 ndarray로 변환: values를 이용하여 변환 가능

In [ ]:
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

##### DataFrame을 리스트로 변환: tolist() 호출

In [ ]:
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

##### DataFrame을 딕셔너리로 변환: to_dict() 호출, 인자로 'list' 입력 시, 딕셔너리의 값이 리스트형으로 반환됨

In [ ]:
dict3 = df_dict.to_dict()
print('df_dict.to_dict() 타입:', type(dict))
print(dict3)

df_dict.to_dict() 타입: <class 'dict'>
{'col1': {0: 1, 1: 11}, 'col2': {0: 2, 1: 22}, 'col3': {0: 3, 1: 33}}

In [ ]:
dict3 = df_dict.to_dict('list')
print('df_dict.to_dict() 타입:', type(dict))
print(dict3)

df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

# DataFrame의 칼럼 데이터 세트 생성과 수정

In [ ]:
# 새로운 칼럼 생성
titanic_df['Age_0'] = 0
titanic_df.head(5)

NameError: name 'titanic_df' is not defined

In [ ]:
# 기존 칼럼의 연산을 통해 새로운 칼럼 생성하기
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(5)

In [ ]:
# 기존 칼럼 값 업데이트
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      360.0          1

# DataFrame 데이터 삭제
##### drop() 메서드 이용

In [ ]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1) # axis=1: 칼럼 축 방향으로 드롭을 수행
titanic_drop_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      360.0          1

In [ ]:
# drop()는 inplace를 따로 설정하지 않을 경우, 'inplace=False'로 설정됨
# 아래의 DataFrame에서 'Age_by_10' 칼럼이 삭제되지 않은 것을 확인할 수 있음
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      360.0          1

In [ ]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
# drop()의 inplace=True로 설정할 경우, 반환 값은 'None'이므로, 
# inplace=True로 설정한 채 반환 값을 자신의 DataFrame 객체로 할당하면 안됨!
# DataFrame 객체 변수를 아예 None으로 만들어버림

print('inplace=True로 drop한 후, 반환된 값:', drop_result)
titanic_df.head(3)

inplace=True로 drop한 후, 반환된 값: None

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [ ]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)

In [ ]:
print('#### before axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [ ]:
# axis=0 로우 축 방향으로 드롭을 수행하는 경우는 이상치 데이터를 삭제할 때 주로 사용함
titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

# Index 객체

In [ ]:
# 원본 파일 다시 로딩
titanic_df = pd.read_csv('train.csv')

In [ ]:
# Index 객체 추출
indexes = titanic_df.index
print(indexes)

# Index 객체를 실제 값 array로 변환
print('Index 객체 array값\n', indexes.values)

# titanic_df에는 총 891개의 row가 있으므로, index는 0부터 890까지 존재

RangeIndex(start=0, stop=891, step=1)
Index 객체 array값
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

##### Index 객체는 식별성 데이터를 '1차원 array'로 가지고 있음. 
##### ndarray와 유사하게 단일 값 반환 및 슬라이싱이 가능

In [ ]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [ ]:
# 그러나 한 번 만들어진 DataFrame 및 Series의 Index 객체는 함부로 변경 불가
# Why? Index는 식별을 위해 순차적으로 데이터 값에 부여된 객체이기 때문!
indexes[0] = 5

TypeError: Index does not support mutable operations

In [ ]:
# Series 객체에 연산 함수를 적용할 때, Index는 연산에서 제외됨. Index는 오직 '식별용'으로만 사용됨!!

series_fair = titanic_df['Fare']
print('Fair Series max 값:', series_fair.max(), '\n')

print('Fair Series sum 값:', series_fair.sum())
print('sum() Fair Series:', sum(series_fair), '\n')

print('Fair Series + 3:\n', (series_fair + 3).head(3))

Fair Series max 값: 512.3292

Fair Series sum 값: 28693.9493
sum() Fair Series: 28693.949299999967

Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

##### reset_index(): 새로운 인덱스를 연속 숫자 형으로 할당, 기존 인덱스는 'index'라는 새로운 칼럼 명으로 추가

In [ ]:
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [ ]:
# 'Pclass' 칼럼 Series의 value_counts()를 수행할 경우, 'Pclass' 고유 값이 식별자 인덱스 역할을 수행
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입:', type(value_counts))

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_counts 객체 변수 타입: <class 'pandas.core.series.Series'>

In [ ]:
# reset_index()를 적용하면 기존 인덱스가 칼럼으로 추가되어, 칼럼이 2개가 됨
# 따라서 Series에 reset_index()를 적용하면, Series가 아닌 DataFrame이 반환됨

new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)
print('new_value_counts 객체 변수 타입:', type(new_value_counts))

### After reset_index ###
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts 객체 변수 타입: <class 'pandas.core.frame.DataFrame'>

# 데이터 셀렉션 및 필터링

### DataFrame의 [ ] 연산자

In [ ]:
# DataFrame 뒤의 []에는 칼럼명을 지정해야 함.
print('단일 칼럼 데이터 추출:\n', titanic_df['Pclass'].head(3))
print('\n여러 칼럼의 데이터 추출:\n', titanic_df[['Survived', 'Pclass']].head(3))

print('[]안에 숫자 index는 KeyError 오류를 발생시킴:\n', titanic_df[0])

단일 칼럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 칼럼의 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

In [ ]:
# 인덱스 형태로 변환 가능한 표현식은 []내에 입력할 수 있으므로, 슬라이싱 가능!
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [ ]:
# 불린 인덱싱: 'Pclass' 컬럼 내 데이터 값이 3인 열만 추출!
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

### DataFrame ix[ ] 연산자: 칼럼 명칭(label) 기반 인덱싱

In [ ]:
# ix[] 메서드는 칼럼 '명칭' 기반과 '위치' 기반 두가지 방식을 모두 제공하기 때문에, 가독성이 떨어지는 문제가 발생
# 현재 ix[] 메서드는 판다스에서 삭제됨
print('칼럼 위치 기반 인덱싱 데이터 추출:', titanic_df.ix[0,2])
print('칼럼 명 기반 인덱싱 데이터 추출:', titanic_df.ix[0, 'Pclass'])

AttributeError: 'DataFrame' object has no attribute 'ix'

### 명칭 기반 인덱싱과 위치 기반 인덱싱의 구분
##### 명칭(Label) 기반 인덱싱: 칼럼의 명칭을 기반으로 위치를 지정
##### 위치(Position) 기반 인덱싱: 0을 출발점으로 하는 가로축, 세로축 좌표 기반의, 행과 열 위치 정수 값을 기반으로 데이터를 지정

In [ ]:
data = {'Name':['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year':[2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }

data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [ ]:
# data_df를 reset_index()로 새로운 숫자형 인덱스를 생성
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})
print(data_df_reset)

  old_index      Name  Year  Gender
0       one   Chulmin  2011    Male
1       two  Eunkyung  2016  Female
2     three  Jinwoong  2015    Male
3      four   Soobeom  2015    Male

In [ ]:
# 인덱스 값에 1을 더해, 1부터 시작하는 새로운 인덱스 값 생성
data_df_reset.index = data_df_reset.index + 1
print(data_df_reset)

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

### DataFrame iloc[ ] 연산자: 위치 기반 인덱싱만 허용
##### 슬라이싱 / 팬시 인덱싱은 제공하나, 명확한 위치 기반 인덱싱만 사용되어야 하므로 불린 인덱싱은 제공x

In [ ]:
data_df.iloc[0,0]

'Chulmin'

In [ ]:
# 위치 인덱싱이 아닌 명칭을 입력하면 오류 발생
data_df.iloc[0, 'Name']
data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [ ]:
data_df_reset.iloc[0,1]

'Chulmin'

### DataFrame loc[ ] 연산자: 명칭 기반 인덱싱만 허용

In [ ]:
data_df.loc['one', 'Name']

'Chulmin'

In [ ]:
# 인덱스 명칭이 숫자 형인 경우, 명칭 기반 인덱싱에서도 정수형 인덱스를 입력받을 수 있음
data_df_reset.loc[1, 'Name']

'Chulmin'

In [ ]:
# 0이라는 명칭을 가진 인덱스는 없으므로 오류 발생
data_df_reset.loc[0, 'Name']

KeyError: 0

##### 명칭 기반 인덱싱 loc[ ]에 슬라이싱 기호를 적용하면, '종료 값-1'이 아닌, '종료 값'까지 포함하여 슬라이싱 함
##### 명칭은 숫자 형이 '아닐 수 있기 때문에' -1이 불가능함

In [ ]:
print('위치 기반 iloc slicing\n', data_df.iloc[0:1, 0], '\n')
print('명칭 기반 loc slicing\n', data_df.loc['one':'two','Name']) # 'one'까지만 출력되는 것이 아니라, 'two'까지 출력됨

위치 기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

명칭 기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

### 불린 인덱싱: loc[ ]에서만 지원됨

In [ ]:
titanic_df = pd.read_csv('train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean)) # 객체 타입은 DataFrame!
titanic_boolean.head(5)

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked
33            34         0       2  Wheadon, Mr...  male  66.0      0      0  C.A. 24579  10.5000   NaN        S
54            55         0       1  Ostby, Mr. ...  male  65.0      0      1      113509  61.9792   B30        C
96            97         0       1  Goldschmidt...  male  71.0      0      0    PC 17754  34.6542    A5        C
116          117         0       3  Connors, Mr...  male  70.5      0      0      370369   7.7500   NaN        Q
170          171         0       1  Van der hoe...  male  61.0      0      0      111240  33.5000   B19        S

In [ ]:
# Age가 60을 넘는 승객의 이름과 나이를 추출
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [ ]:
# 불린 인덱싱은 loc[]에도 동일하게 적용됨! 단, 'Name'과 'Age'를 칼럼 위치에 두어야 함
titanic_df.loc[titanic_df['Age'] > 60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

##### and => &
##### or => |
##### Not => ~

In [ ]:
# 1등석에 탑승한 60세를 넘는 여성의 명단만 추출
titanic_df[ (titanic_df['Age'] > 60) & (titanic_df['Pclass'] == 1) &
          (titanic_df['Sex'] == 'female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

# 정렬, Aggregation 함수, GroupBy 적용
### DataFrame과 Series의 정렬 - sort_values()
##### ascending = True => 오름차순 정렬 / ascending = False => 내림차순 정렬 
##### ** Default: ascending = True / inplace = False

In [ ]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [ ]:
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

### Aggregation 함수 적용
##### DataFrame에서 바로 aggregation을 호출할 경우, 모든 칼럼에 해당 aggregation을 적용함

In [ ]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [ ]:
# 특정 칼럼에 aggregation 함수 적용
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

### groupby() 적용
##### DataFrame에 groupby()를 호출하면 DataFrameGroupBy라는 또 다른 형태의 DataFrame을 반환

In [ ]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

##### DataFrame에 groupby()를 호출해 반환된 결과에 aggregation 함수를 호출하면 groupby() '대상 칼럼을 제외한' 모든 칼럼에 해당 함수를 적용

In [ ]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

##### DataFrame의 groupby()에 특정 칼럼만 aggregation 함수를 적용하려면,  groupby()로 반환된 DataFrameGroupBy 객체에 해당 칼럼을 
##### 필터링한 뒤, aggregation 함수를 적용해야 함

In [ ]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

##### 서로 다른 aggreation 함수를 적용할 경우, 여러 함수명을 DataFrameGroupBy 객체의 agg() 내에 인자로 입력해서 사용

In [ ]:
# 각 Pclass 별로 가장 많은 나이와, 가장 적은 나이를 추출
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

##### 여러개의 칼럼이 서로 다른 aggregation 함수를 groupby에서 호출하려면, 
##### agg() 내에 입력 값으로  '딕셔너리' 형태로 aggregation이 적용될 칼럼들과, aggregation 함수를 입력

In [ ]:
# 'Age'에는 max를 적용, 'SibSp'에는 sum을 적용, 'Fare'에는 mean을 적용 
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

# 결손 데이터 처리하기
##### 결손 데이터: 칼럼에 값이 없는, 즉 NULL인 경우를 의미, 넘파이의 NaN으로 표시!
##### 머신러닝 알고리즘은 NaN 값을 처리하지 않으므로, 이 값을 다른 값으로 대체해야 함
### isna()로 결손 데이터 여부 확인: NULL 값이 있을 경우, True, NULL 값이 없을 경우 False 반환

In [ ]:
titanic_df.isna().head(5)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False
3        False     False   False  False  False  False  False  False   False  False  False     False
4        False     False   False  False  False  False  False  False   False  False   True     False

##### sum() 함수를 통해 결손 데이터 개수를 알 수 있음 (True = 1, False = 0)

In [ ]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### fillna()로 결손 데이터 대체하기
##### Default: inplace=False이므로, 실제 데이터 세트 값을 변경하려면 inplace=True 적용

In [ ]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [ ]:
# 'Age' 칼럼의 NaN값을 평균 나이로, 'Embarked' 칼럼의 NaN 값을 'S'로 대체하여 모든 결손 데이터를 처리
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### apply lambda 식으로 데이터 가공
##### lambda 함수에 관한 간략한 설명

In [ ]:
def get_square(a):
    return a**2
print('3의 제곱은:', get_square(3))

lambda_square = lambda a : a**2
print('3의 제곱은:', lambda_square(3))

# lambda 식을 이용할 때, 여러 값을 입력 인자로 사용해야 하는 경우에는 map()함수를 결합하여 사용
b = [1,2,3]
squares = map(lambda a : a**2, b)
list(squares)

3의 제곱은: 9
3의 제곱은: 9

[1, 4, 9]

In [ ]:
# 'Name' 칼럼의 문자열 개수를, 별도의 칼럼인 'Name_len'에 생성
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

##### Lamda 식에서의 if else 절 사용: if절의 경우 if 식보다 반환 값을 먼저 기술하여, ':' 기호의 오른 편에 반환 값이 오게 만들어야 함

In [ ]:
# 15세 미만이면 'Child', 그렇지 않으면 'Adult'
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x < 15 else 'Adult')

titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [ ]:
# ~14세: Child
# 15세 ~ 60세: Adult
# 61세~: Elderly
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x < 15 else ('Adult' if x <= 60
                                                                                  else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      791
Child       78
Elderly     22
Name: Age_cat, dtype: int64

###### else if가 많이 나와야 하는 경우 / swich case문의 경우, 별도의 함수를 생성

In [ ]:
def get_category(age):
    cat=''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

# lambda 식에, 위에서 지정한 get_category() 함수를 반환값으로 지정
# get_category(X)는 입력값으로 'Age' 칼럼 값을 입력 받아 해당하는 cat을 반환함
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head(10)

         Age      Age_cat
0  22.000000      Student
1  38.000000        Adult
2  26.000000  Young Adult
3  35.000000  Young Adult
4  35.000000  Young Adult
5  29.699118  Young Adult
6  54.000000        Adult
7   2.000000         Baby
8  27.000000  Young Adult
9  14.000000     Teenager